# 1. (a + b * c)^2
# 2. a - 4 * b / c
# 3. (a * b + 4) / (c - 1)

a = int(input("Введите значение для a: "))
b = int(input("Введите значение для b: "))
c = int(input("Введите значение для c: "))
x = (a + b * c)**2

print("Решение первого уравнения равно: ", x)
print("#######################################")

a = int(input("Введите значение для a: "))
b = int(input("Введите значение для b: "))
c = int(input("Введите значение для c: "))
x = a - 4 * b / c

print("Решение второго уравнения равно: ", x)

print("#######################################")

a = int(input("Введите значение для a: "))
b = int(input("Введите значение для b: "))
c = int(input("Введите значение для c: "))
x = (a * b + 4) / (c - 1)

print("Решение третьего уравнения равно: ", x)
