# Найти произведение нечетных цифр пятизначного целого числа, введенного пользователем с клавиатуры
number = input("Введите пятизначное число: ")
mlt = 1
for i in number:
    if int(i) % 2 != 0:
        mlt *= int(i)
print("Произведение нечетных чисел пятизначного числа равен: ", mlt)
